from math import pi

R = 114.1 * 10**(-3)
r = 30.5* 10**(-3)
z_0 = 2165* 10**(-3)
k = 9.81 * R * r / (4 * pi ** 2 * z_0)
print(k)
sigma_r = 0.3* 10**(-3)
sigma_R = 0.5* 10**(-3)
sigma_z_0 = 0.5* 10**(-3)
sigma_k = k * ((sigma_r / r) ** 2 + (sigma_R / R) ** 2 + (sigma_z_0 / z_0) ** 2) ** 0.5
print('константа и ее погрешность равны: ', k, sigma_k)

# пустой
t = 35.232
T = t/8
sigma_T = 0.005*T
m = 1004.8* 10**(-3)
sigma_m = 0.5* 10**(-3)
I_c = k * m * T ** 2
sigma_I_c = I_c * ((sigma_k / k) ** 2 + 2 * (sigma_T / T) ** 2 + (sigma_m / m) ** 2)**0.5
print('момент инерции и его погрешность: ', I_c, sigma_I_c, sigma_I_c/I_c)


# цилиндр
t = 33.611
T = t/8
sigma_T = 0.005*T
m = 777.2* 10**(-3) + 1004.8* 10**(-3)
sigma_m = 0.1* 10**(-3)
I = k * m * T ** 2
sigma_I = I * ((sigma_k / k) ** 2 + 2 * (sigma_T / T) ** 2 + (sigma_m / m) ** 2)**0.5
r = (151.5 + 165.3)/4 * 10**(-3)
print('момент инерции и его погрешность: ', I, sigma_I , sigma_I/I)
m = 777.2* 10**(-3)
print('действительные момент инерции и погрешность: ', I - I_c, sigma_I - sigma_I_c, m*r**2 )

# диск
t = 30.016
T = t/8
sigma_T = 0.005*T
m = 881.4* 10**(-3) + 1004.8* 10**(-3)
sigma_m = 0.1* 10**(-3)
I = k * m * T ** 2
sigma_I = I * ((sigma_k / k) ** 2 + 2 * (sigma_T / T) ** 2 + (sigma_m / m) ** 2)**0.5
r = (167.4)/2*10**(-3)
print('момент инерции и его погрешность: ', I, sigma_I, sigma_I/I)
m = 881.4* 10**(-3)
print('действительные момент инерции и погрешность: ', I - I_c, sigma_I - sigma_I_c, m*r**2/2 )

# вместе
t = 30.305
T = t/8
sigma_T = 0.005*T
m = (881.4 + 777.2)* 10**(-3) + 1004.8* 10**(-3)
sigma_m = 0.1* 10**(-3)
I = k * m * T ** 2
sigma_I = I * ((sigma_k / k) ** 2 + 2 * (sigma_T / T) ** 2 + (sigma_m / m) ** 2)**0.5
print('момент инерции и его погрешность: ', I, sigma_I, sigma_I/I)
m = (881.4 + 777.2)* 10**(-3)
print('действительные момент инерции и погрешность: ', I - I_c, sigma_I - sigma_I_c )

# палочка
t = 30.144
T = t/8
sigma_T = 0.005*T
m = 1191.5* 10**(-3) + 1004.8* 10**(-3)
sigma_m = 0.1* 10**(-3)
I = k * m * T ** 2
sigma_I = I * ((sigma_k / k) ** 2 + 2 * (sigma_T / T) ** 2 + (sigma_m / m) ** 2)**0.5
l = 210 * 10**(-3)
print('момент инерции и его погрешность: ', I, sigma_I, sigma_I/I)
m = 1191.5* 10**(-3)
print('действительные момент инерции и погрешность: ', I - I_c, sigma_I - sigma_I_c, m*l**2/12 )
